; domain
(define (domain serveToast)
  (:requirements :strips :conditional-effects  :equality)

  ;; ───── Constants ────
  ;; Fixed objects in the scene
  (:constants bread egg fridge knife plate pan mug toaster stoveburner coffeemachine dining_table counter_1 counter_2 counter_1_l counter_2_l dining_table_l fridge_l default_l)

    ;; ───── Predicate Definitions ─────
    (:predicates
    ; #TODO
      (robotat ?l)
      (holding ?o)
      (open ?d)
      (switchedon ?d)
      (sliced ?o)
      (toasted ?o)
      (on ?d ?c)
      (in ?o ?c)
      (at ?o ?l)
      (handempty)
    )

    ;; ───── Action Definitions ─────
    ; #TODO
    (:action open
      :parameters (?d ?l)
      :precondition (and (robotat ?l) (not (open ?d)) (at ?d ?l))
      :effect (open ?d)
    )

    (:action move
      :parameters (?from ?to)
      :precondition (robotat ?from)
      :effect (and
        (not (robotat ?from))
        (robotat ?to)
      )
    )

    (:action turn_off
      :parameters (?d ?l)
      :precondition (and 
        (robotat ?l) 
        (at ?d ?l)
        (switchedon ?d)
      )
      :effect (not (switchedon ?d))
    )

    (:action turn_on
      :parameters (?d ?l)
      :precondition (and 
        (robotat ?l) 
        (at ?d ?l)
        (not (switchedon ?d))
      )
      :effect (and 
        (switchedon ?d)
        ;; this is when device is toaster and bread is in 
        ;; toaster then toast the bread
        (when (and (= ?d toaster) (in bread toaster) (sliced bread))
            (toasted bread)
        )
      )
    )

    (:action slice
      :parameters (?o ?l)
      :precondition (and 
        (robotat ?l) 
        (holding knife)
        (not (handempty))
        (not (sliced ?o))
        (not (toasted ?o))
        (on ?o counter_1)
        (at ?o ?l)
        (= ?l counter_1_l)
      )
      :effect (sliced ?o)
    )

    (:action pick
      :parameters (?o ?c ?l)
      :precondition (and 
        (robotat ?l) 
        (not (holding ?o))
        (handempty)
        (or (on ?o ?c) (in ?o ?c))
        (at ?o ?l)
        (at ?c ?l)
        (or (not (= ?c fridge)) (open ?c))

      )
      :effect (and
        (holding ?o)
        (not (handempty))
        (not (on ?o ?c))
        (not (in ?o ?c))
        (not (at ?o ?l))
      )
    )

    (:action put
      :parameters (?o ?c ?l)
      :precondition (and 
        (robotat ?l) 
        (holding ?o)
        (not (handempty))
        (not (on ?o ?c))
        (not (in ?o ?c))
        (at ?c ?l)
        (or (= ?c counter_1) (= ?c counter_2) (= ?c dining_table) (= ?c toaster) (= ?c plate))
      )
      :effect (and
        (not (holding ?o))
        (handempty)
        (at ?o ?l)
        (when (= ?c toaster)
          (in ?o ?c)
        )
        (when (not (= ?c toaster))
          (on ?o ?c)
        )
      )
    )
  )

; problem
(define (problem serveToast-totable)
  (:domain serveToast)

  (:init
    ;; #TODO

    ; Configurations
    (handempty)

    ; Objects location
    (robotat default_l)

    (in bread fridge)
    (on knife counter_1)
    (on toaster counter_1)
    (on plate dining_table)
    
    (at fridge fridge_l)
    (at counter_1 counter_1_l)
    (at dining_table dining_table_l)
    (at counter_2 counter_2_l)

    (at bread fridge_l)
    (at knife counter_1_l)
    (at toaster counter_1_l)
    (at plate dining_table_l)
  )

  (:goal
    ;; #TODO
    (and 
      (sliced bread)
      (toasted bread)
      (on bread plate)
      (on plate dining_table)
      
    )
  )
)

; plan
1. (move default_l fridge_l)
   deleted: (robotat default_l)
   added: (robotat fridge_l)
   goals met: 1 of 4
2. (open fridge fridge_l)
   added: (open fridge)
   goals met: 1 of 4
3. (pick bread fridge fridge_l)
   deleted: (handempty) (in bread fridge) (at bread fridge_l)
   added: (holding bread)
   goals met: 1 of 4
4. (move fridge_l counter_1_l)
   deleted: (robotat fridge_l)
   added: (robotat counter_1_l)
   goals met: 1 of 4
5. (put bread counter_1 counter_1_l)
   deleted: (holding bread)
   added: (handempty) (at bread counter_1_l) (on bread counter_1)
   goals met: 1 of 4
6. (pick knife counter_1 counter_1_l)
   deleted: (handempty) (on knife counter_1) (at knife counter_1_l)
   added: (holding knife)
   goals met: 1 of 4
7. (slice bread counter_1_l)
   added: (sliced bread)
   goals met: 2 of 4
8. (put knife counter_1 counter_1_l)
   deleted: (holding knife)
   added: (handempty) (at knife counter_1_l) (on knife counter_1)
   goals met: 2 of 4
9. (pick bread counter_1 counter_1_l)
   deleted: (handempty) (on bread counter_1) (at bread counter_1_l)
   added: (holding bread)
   goals met: 2 of 4
10. (put bread toaster counter_1_l)
   deleted: (holding bread)
   added: (handempty) (at bread counter_1_l) (in bread toaster)
   goals met: 2 of 4
11. (turn_on toaster counter_1_l)
   added: (switchedon toaster) (toasted bread)
   goals met: 3 of 4
12. (pick bread toaster counter_1_l)
   deleted: (handempty) (in bread toaster) (at bread counter_1_l)
   added: (holding bread)
   goals met: 3 of 4
13. (move counter_1_l dining_table_l)
   deleted: (robotat counter_1_l)
   added: (robotat dining_table_l)
   goals met: 3 of 4
14. (put bread plate dining_table_l)
   deleted: (holding bread)
   added: (handempty) (at bread dining_table_l) (on bread plate)
   goals met: 4 of 4
